Repository: Walfrosch92/Mealie-Recipes-iOS-APP
Catalog: MealieRecipes/*.lproj/Localizable.strings
Languages: de

source: Initial Setup
de: Ersteinrichtung

source: ⚙️ Settings
de: ⚙️ Einstellungen

# save_and_start
source: Save & Start
de: Speichern & Starten

source: Save Changes
de: Änderungen speichern

source: Reset App
de: App zurücksetzen

source: Send optional headers
de: Optionale Header senden

source: Language
de: Sprache

# confirm_reset
source: Really reset the app?
de: App zurücksetzen?

source: Cancel
de: Abbrechen

source: Reset
de: Zurücksetzen

# reset_warning
source: All saved settings will be cleared and must be re-entered.
de: Dies setzt alle Einstellungen zurück. Fortfahren?

source: Loading shopping list ID...
de: Lade Einkaufsliste...

# welcome_title
source: Welcome to Mealie Recipes! 👋
de: Willkommen bei Mealie Recipes! 👋

# select_option
source: Choose an option:
de: Option auswählen:

# show_recipes
source: 📖 View Recipes
de: 📖 Rezepte anzeigen

source: 🛒 Shopping List
de: 🛒 Einkaufsliste

source: Archived Lists
de: 🗂️ Archivierte Listen

source: Home
de: Start

source: Recipes
de: 📖 Rezepte

source: Loading recipes...
de: Lade Rezepte...

# error_loading_recipes
source: Error: %@
de: Fehler: %@

source: Invalid recipe ID
de: Ungültige Rezept-ID

source: Search recipe
de: Rezept suchen

source: Change
de: Ändern

source: Apply
de: Übernehmen

source: Minimize
de: Minimieren

# duration
source: Duration: %d minutes
de: Dauer: %d Minuten

# new_duration
source: New duration: %d minutes
de: Neue Dauer: %d Minuten

# remaining_time
source: %d minutes %d seconds remaining
de: %d Minuten %d Sekunden verbleibend

# add_success
source: Added ✅
de: Hinzugefügt ✅

# list_done_title
source: List completed 🎉
de: Liste abgeschlossen 🎉

# list_done_message
source: The shopping list has been archived.
de: Die Einkaufsliste wurde archiviert.

# add_item_placeholder
source: New item…
de: Neuer Artikel…

source: Complete shopping
de: Einkauf abschließen

# shopping_done_title
source: Shopping completed
de: Einkauf abgeschlossen

# shopping_done_subtitle
source: Everything's in the cart! 🎉
de: Alles ist im Einkaufswagen! 🎉

source: Loading recipe...
de: Rezept wird geladen...

# error_loading_recipe
source: Failed to load recipe.
de: Rezept konnte nicht geladen werden.

source: Add all ingredients
de: Alle Zutaten hinzufügen

# add_selected_ingredients
source: Add selected ingredients only
de: Nur ausgewählte Zutaten hinzufügen

# add_ingredients_title
source: Ingredients Added
de: Zutaten hinzugefügt

# add_ingredients_message
source: Ingredients were successfully added to the shopping list.
de: Die Zutaten wurden erfolgreich zur Einkaufsliste hinzugefügt.

source: Ingredients
de: Zutaten

# adjust_quantity
source: Adjust quantity multiplier for this recipe:
de: Mengenfaktor für dieses Rezept anpassen:

source: Instructions
de: Anleitung

source: Display always on
de: Anzeige immer eingeschaltet

source: Start Timer
de: Timer starten

# running_timer
source: Timer running: %dm %ds
de: Timer läuft: %dm %ds

source: Delete All
de: Alle löschen

# delete_confirm_title
source: Delete all archived lists?
de: Alle archivierten Listen löschen?

# delete_confirm_message
source: This action cannot be undone.
de: Dieser Vorgang kann nicht rückgängig gemacht werden.

source: Delete
de: Löschen

# list_title
source: List %d
de: Liste %d

# recipe_upload
source: ➕ Add Recipe
de: ➕ Rezept hinzufügen

# image_placeholder_url
source: https://example.com/recipe
de: https://example.com/rezept

source: Uploading image...
de: Bild wird hochgeladen...

# enter_recipe_url_hint
source: Enter the recipe URL to save the recipe to your server
de: Gib die Rezept-URL ein, um das Rezept auf deinem Server zu speichern

source: Upload Result
de: Upload-Ergebnis

# image_load_error
source: ❌ Failed to load image.
de: ❌ Bild konnte nicht geladen werden.

# upload_error
source: Error
de: Fehler

# upload_http_error
source: Image upload failed with status code %d
de: Datei-Upload fehlgeschlagen mit Statuscode %d

# image_conversion_error
source: Failed to convert image to upload format.
de: Bild konnte nicht in ein Upload-Format konvertiert werden.

# image_upload_hint
source: Alternatively, upload a photo of a recipe. It will be analyzed and imported automatically using AI.
de: Alternativ kannst du ein Foto oder PDF eines Rezepts hochladen. Es wird automatisch mit KI analysiert und importiert.

# openai_hint_title
source: Image Recognition Info
de: Dateianalyse-Info

# openai_hint_message
source: Recipe image analysis is powered by the OpenAI API. Please make sure your API key is set in the app settings.
de: Die Rezeptanalyse erfolgt über die OpenAI API. Stelle sicher, dass dein API-Schlüssel in den Mealie Server-Einstellungen hinterlegt ist.

# upload_from_url
source: Upload to Server
de: Rezept von URL importieren

# upload_url_section_title
source: Import via Recipe URL
de: Import über Rezept-URL

# upload_image_section_title
source: Import via OpenAI from Image
de: Import über OpenAI aus Datei

# upload_recipe
source: Upload a new Recipe
de: Neues Rezept hochladen

source: Select Image
de: Bild auswählen

# error_invalid_json
source: Invalid JSON content
de: Ungültiger JSON-Inhalt

# error_payload_encoding
source: Failed to encode payload
de: Fehler beim Kodieren der Daten

# error_image_conversion
source: Failed to convert image
de: Fehler bei der Bildkonvertierung

# error_upload_failed
source: Upload failed
de: Upload fehlgeschlagen

# error_image_upload_failed
source: Image upload failed
de: Bild-Upload fehlgeschlagen

# error_missing_base_url
source: Missing API configuration
de: Server-URL oder Token fehlt.

# error_invalid_shopping_list_id
source: Invalid shopping list ID
de: Ungültige Einkaufslisten-ID.

# upload_success
source: Upload successful!
de: Upload erfolgreich!
